# ------------------------------------------------Проверочный список--------------------------------------------
number_list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
print([number_list[i] for i in range(1, len(number_list)) if number_list[i] > number_list[i - 1]])

# -------------------------------------------------New list--------------------------------------------------------
new_list = [1, 5, 124, 33, 2, 23, 11, 15, 10, 100, 31, 23, 33, 43, 53]
print([new_list[i] for i in range(1, len(new_list)) if new_list[i] > new_list[i - 1]])
